Repository: anoopjohn/gphpedit
Catalog: po/*.po
Languages: hu

source: Name
hu: Név

source: FILE:
hu: Fájl:

source: FILE:
hu: Fájl:

source: Help for function not found: %s
hu: %s funkcióhoz nem található súgó

source: gPHPEdit UTF-8 Error: %s
hu: UTF-8 hiba történt: %s

source: Converted to UTF-8 size: %u
hu: Méret UTF-8-ra konvertálva: %u

source: The file %s was not found. Would you like to create it as an empty document?
hu: A %s fájl nem található. Létrehozzunk egy üres dokumentumot?

source: File not found
hu: A fájl nem található

source: Could not get the file info. GIO error: %s
hu: Nem érhető el fájlinformáció. GIO hiba: %

source: Sorry, I can open this kind of file.
hu: Az ilyen típusú fájlt nem lehet megnyitni.

source: Close Tab
hu: Lap bezárása

source: Saving %s
hu: %s mentése

source: No marker found
hu: A jelölő nem található!

source: Error filesystem not mounted. Mounting filesystem, this will take a few seconds...
hu: Hiba: a fájlrendszer nincs csatolva. A fájlrendszer csatolása eltarthat néhány pillanatig...

source: Could not find the required command in the online help
hu: A keresett parancs nem található az online súgóban.

source: Question
hu: Kérdés

source: Are you sure you wish to reload the current file, losing your changes?
hu: Ha újratölti az aktuális fájlt, a módosítások elvesznek. Valóban ezt szeretné?

source: Reloading %s
hu: %s fájl újratöltése...

source: <b>The file '%s' has not been saved since your last changes.</b> <small>Are you sure you want to close it and lose these changes?</small>
hu: <b>A '%s' fájl utolsó változtatásai még nincsenek elmentve.</b> <small>Valóban be szeretné zárni a változások mentése nélkül?</small>

source: Close and _lose changes
hu: Bezárás és a változtatások elvetése

source: Could not get the file modification time. GIO error: %s
hu: A fájl utolsó módosításának időpontja nem megállapítható. GIO hiba: %s

source: UTF-8 Error: %s
hu: UTF-8 hiba történt: %s

source: Untitled
hu: Névtelen

source: Do you want to replace this occurence?
hu: Lecseréljük ezt?

source: <b>The file "%s" has been externally modified.</b>
hu: <b>A(z) "%s" fájl változott az utolsó beolvasása óta.</b>

source: Do you want reload it?
hu: Szeretné újratölteni ezt?

source: Unhandle keyboard macro function %d, please report
hu: Hibás %d billentyűzet-macro, kérjük jelentse a hibát

source: Help:
hu: Súgó:

source: Preview:
hu: Előnézet:

source: Add/Edit Template
hu: Sablon létrehozása/szerkesztése

source: Name/Shortcut:
hu: Név:

source: Code:
hu: Kód:

source: Error getting file browser files. GIO Error:%s
hu: Hiba lépett fel a fájlok böngészése közben. GIO hiba:%s

source: Error::%s
hu: Hiba:: %s

source: Are you sure you wish to delete this file?
hu: Valóban véglegesen törölni szeretné ezt a fájlt?

source: Error creating folder. GIO error:%s
hu: Hiba történt a mappa létrehozásakor. GIO hiba: %s

source: %s cannot be copied, it already exists, overwrite?
hu: %s nem másolható, mert már létezik. Felülírja?

source: Overwrite file?
hu: Felülírja a fájlt?

source: File
hu: Fájl

source: Mime
hu: Mime típus

source: Rename File
hu: Fájl átnevezése

source: New Filename
hu: Írja be az új állománynevet

source: New Dir
hu: Új könyvtár

source: Directory Name
hu: Könyvtár neve

source: Open file
hu: Fájl megnyitása

source: Delete file
hu: Fájl törlése

source: Create New Directory
hu: Könyvtár létrehozása

source: Resuming search from top.
hu: Átfogó keresés a dokumentum elejétől.

source: The text "%s" was not found.
hu: A "%s" szöveg nem található.

source: Find
hu: Keresés

source: _Match case
hu: Kis- és nagybetű

source: Match _entire word only
hu: Csak teljes szóra

source: Whole document
hu: Teljes dokumentum

source: RegExp
hu: Reg.kif

source: Go to line:
hu: Ugrás erre a sorra…

source: Go to line
hu: Ugrás erre a sorra…

source: PHP/HTML/XML
hu: PHP/HTML/CSS

source: Text-Plain
hu: Egyszerű szöveg

source: OVR
hu: ÁTÍR

source: INS
hu: BESZ

source: Zoom: %d%s
hu: Nagyítás: %d%s

source: Ln %d, Col %d
hu: %d. sor, %d. oszlop

source: Line background
hu: Sorháttér

source: Line background color
hu: Sorháttér színe

source: Background
hu: Háttér

source: Background color
hu: Háttérszín

source: Foreground
hu: Előtér

source: Foreground color
hu: Előtérszín

source: Bold
hu: Vastag

source: Italic
hu: Dőlt

source: Underline
hu: Aláhúzott

source: Strikethrough
hu: Áthúzott

source: Line background set
hu: Sorháttér beállítva

source: Whether line background color is set
hu: A sorháttérszín beállítva

source: Foreground set
hu: Előtér beállítása

source: Whether foreground color is set
hu: Az előtérszín beállítva

source: Background set
hu: Háttér beállítása

source: Whether background color is set
hu: A háttérszín beállítva

source: Bold set
hu: Félkövér beállítva

source: Whether bold attribute is set
hu: A félkövér attribútum beállítva

source: Italic set
hu: Dőlt beállítva

source: Whether italic attribute is set
hu: A dőlt attribútum beállítva

source: Underline set
hu: Aláhúzás beállítása

source: Whether underline attribute is set
hu: Az aláhúzott attribútum beállítva

source: Strikethrough set
hu: Áthúzás beállítása

source: Whether strikethrough attribute is set
hu: Az áthúzott attribútum beállítva

source: Style scheme id
hu: Stílusséma azonosítója

source: Style scheme name
hu: Stílusséma neve

source: Style scheme description
hu: Stílusséma leírása

source: Style scheme filename
hu: Stílusséma fájlneve

source: Style scheme search path
hu: Stílusséma elérési útvonala

source: List of directories and files where the style schemes are located
hu: A stílussémákat tartalmazó könyvtárak és fájlok listája

source: Scheme ids
hu: Sémaazonosítók

source: List of the ids of the available style schemes
hu: Az elérhető stílussémák azonosítóinak listája

source: Error reading file sync '%s'. GIO error:%s
hu: Hiba a '%s' fájl olvasásakor. GIO hiba: %s

source: Error renaming file. GIO Error:%s
hu: GIO hiba a fájl átnevezésekor: %s

source: GIO Error deleting file: %s
hu: GIO hiba a fájl törlése közben: %s

source: Error saving temp file: '%s'. GIO Error:%s
hu: GIO hiba az ideiglenes '%s' fájl mentése közben: %s

source: Error calling PHP CLI (is PHP command line binary installed? If so, check if it's in your path or set php_binary in Preferences)
hu: Hibát jelzett a PHP CLI (PHP parancssori alkalmazás telepítve? Ha igen, ellenőrizze az elérési útvonalat vagy állítsa be a PHP binárist a beállításokban)

source: Close side panel
hu: Oldalpanel bezárása

source: Class Browser
hu: Fájlböngésző

source: PHP files (
hu: PHP fájlok(*.php)

source: HTML files (*.html *.htm *.xhtml *.tpl)
hu: HTML fájlok (*.html *.htm *.xhtml *.tpl)

source: XML files (*.xml)
hu: XML fájlok (*.xml)

source: Stylesheet files (*.css)
hu: CSS fájlok (*.css)

source: SQL files (*.sql)
hu: SQL fájlok (*.sql)

source: Javascript files (*.js)
hu: JavaScript fájlok (*.js)

source: C/C++ files (*.c *.h *.cpp *.hh *.cc)
hu: C/C++ fájlok (*.c *.h *.cpp *.hh *.cc)

source: Perl Files (*.pl *.ph *.pm)
hu: Perl fájlok (*.pl *.ph *.pm)

source: Cobol Files (*.cbl)
hu: Cobol fájlok (*.cbl).

source: Python Files (*.py *.pyd *.pyw)
hu: Python fájlok (*.py *.pyd *.pyw)

source: All files
hu: Minden fájl

source: Please type the filename to save as...
hu: Milyen néven kívánja menteni ezt a fájlt?

source: translator_credits
hu: A magyar fordítást Domokos Endre János készítette, 2013. júniusában.

source: gPHPEdit is a GNOME2 editor specialised for editing PHP scripts and related files (HTML/CSS/JS).
hu: A gPHPEdit a Gnome2 speciális PHP/HTML/CSS/JS szerkesztő alkalmazása.

source: Unable to get data for page %d
hu: A %d laphoz nem érhetők el adatok

source: Creates a new file
hu: Új fájl létrehozása

source: Open a file
hu: Fájl megnyitása

source: _Open selected file
hu: A kijelölt fájl megnyitása

source: Open a file with the name currently selected in the editor
hu: Fájl megnyitása a szerkesztőben a kiválasztott néven

source: _Recent Files
hu: Legutóbbi fájlok

source: Save the file currently selected in the editor
hu: A jelenleg kiválasztott fájl változtatásainak mentése

source: Save A_ll
hu: Az összes mentése

source: Save all open unsaved files
hu: Minden megnyitott fájl mentése

source: Close the current file
hu: A jelenlegi fájl bezárása

source: Quit the application
hu: Kilépés az alkalmazásból

source: Look for help on the currently selected function
hu: Tekintse meg a kiválasztott funkcióhoz tartozó súgót

source: _PHP Help
hu: Súgó szöveg

source: _Report a bug in gPHPEdit
hu: A gPHPEdit hibájának bejelentése

source: Go to bug report page to report a bug
hu: Jelentse ezt a hibát (angolul) a fejlesztőknek.

source: _Translate this application
hu: Ezen alkalmazás fordítása...

source: Start translating this application
hu: Ezen alkalmazás fordításának megkezdése

source: Shows info about gPHPEdit
hu: Információk a gPHPEdit programról

source: Undo last action
hu: Utolsó lépés visszavonása

source: Redo last action
hu: Mégis az utolsó lépést

source: Cut Selected Text
hu: A kijelölt szöveg áthelyezése a vágólapra

source: Copy Selected Text
hu: Kijelölt szöveg másolása

source: Paste Text from clipboard
hu: Szöveg beillesztése a vágólapról

source: Select all Text in current file
hu: Az összes szöveg kijelölése az aktuális fájlban

source: Find text in current file
hu: Szöveg keresése a jelenlegi fájlban

source: Find and replace text in current file
hu: Szöveg keresése és cseréje a jelenlegi fájlban

source: Incremental search
hu: Diferenciált keresés…

source: Search as you type
hu: Írja be a keresendő kifejezést a keresőmezőbe

source: Indent the currently selected block
hu: A kiválasztott blokk behúzásának növelése

source: Unindent the currently selected block
hu: A kiválasztott blokk behúzásának csökkentése

source: _ToUpper
hu: Nagybetűs

source: Convert the current selection text to upper case
hu: A kijelölt szöveg átalakítása csupa nagybetűsre

source: _ToLower
hu: Kisbetűs

source: Convert the current selection text to lower case
hu: A kijelölt szöveg átalakítása csupa kisbetűsre

source: Application Config
hu: Beállítás

source: Statusbar
hu: Állapotsor

source: Show/Hide Application Statusbar
hu: Állapotsor megjelenítése vagy elrejtése

source: Main Toolbar
hu: Fő eszköztár

source: Show/Hide Application Main Toolbar
hu: Fő eszköztár mutatása/rejtése

source: Show Side Panel
hu: Oldalpanel megjelenítése

source: Show/Hide Application Side Panel
hu: Az oldalpanel automatikus megjelenítése/elrejtése

source: Fullscreen
hu: Teljes képernyő

source: Enable/Disable Fullscreen mode
hu: Teljes képernyős mód ki- vagy bekapcsolása

source: Increases zoom in 10%
hu: Nagyítás 10%-al

source: Decreases zoom in 10%
hu: Kicsinyítés 10%-al

source: Restores normal zoom level
hu: Vissza az eredeti mérethez

source: _Toolbar Icon Size
hu: Eszköztárikonok mérete

source: Big Icons
hu: Nagy ikonok

source: Small Icons
hu: Kis ikonok

source: _Show Preview
hu: Előnézet megjelenítése

source: Preview the Document
hu: A dokumentum előnézete

source: Check the syntax using the PHP command line binary
hu: PHP szintaxis ellenőrzése parancssori program segítségével

source: _Syntax check
hu: Szintaxis-ellenőrzés be

source: Remove the syntax check window
hu: Szintaxis-ellenőrző ablak eltávolítása

source: _Clear Syntax check
hu: Szintaxis-ellenőrzés ki

source: Record keyboard actions
hu: Billentyűzet-akciók rögzítése

source: _Record keyboard macro start/stop
hu: Billentyűzet-makró felvétel indítása/leállítása.

source: Playback the stored keyboard macro
hu: Billentyűzet-makró visszajátszása

source: _Playback keyboard macro
hu: Billentyűzet-makró visszajátszása.

source: _Force
hu: Szintaxiskiemelés

source: _PHP/HTML/XML
hu: PHP/HTML/CSS

source: Force syntax highlighting to PHP/HTML/XML mode
hu: PHP/HTML/XML szintaxiskiemelés

source: Force syntax highlighting to CSS mode
hu: CSS szintaxiskiemelés

source: Force syntax highlighting to C/C++ mode
hu: C/C++ szintaxiskiemelés

source: Force syntax highlighting to SQL mode
hu: SQL szintaxiskiemelés

source: Force syntax highlighting to Perl mode
hu: Perl szintaxiskiemelés

source: Force syntax highlighting to Cobol mode
hu: Cobol szintaxiskiemelés

source: Force syntax highlighting to Python mode
hu: Python szintaxiskiemelés

source: _File
hu: Fájl

source: _Edit
hu: Szerkesztés

source: _View
hu: Nézet

source: _Code
hu: Kód

source: _Plugin
hu: Bővítmény

source: _Help
hu: Súgó

source: Enabled
hu: Engedélyezett

source: _About
hu: Névjegy

source: A_ctivate
hu: Aktiválás

source: Ac_tivate All
hu: Összes aktiválása

source: _Deactivate All
hu: Összes letiltása

source: Active _Plugins:
hu: Aktív bővítmények

source: _About Plugin
hu: A bővítmény névjegye

source: Unable to create ~/.gphpedit/ (%d) %s
hu: Nem sikerült létrehozni: ~/gphpedit/ (%d) %s

source: No items found
hu: Nincsenek elemek

source: <b>Session:</b>
hu: <b>Munkamenet:</b>

source: Save session (including open files) on exit
hu: Munkamenet (megnyitott állományok) mentése kilépéskor

source: Only ever run 1 copy of gPHPEdit at a time
hu: A gPHPEditnek egyszerre csak egy példánya futhat

source: <b>Hand edge guide:</b>
hu: <b>Margókezelés:</b>

source: Show right hand edge guide
hu: Jobb margó megjelenítése

source: Right hand edge column
hu: Jobb margó távolsága

source: <b>Side Panel:</b>
hu: <b>Oldal panel:</b>

source: Show file browser (need restart)
hu: Fájlböngésző megjelenítése (újraindítást igényel)

source: Show/Hide side-panel Folder Browser
hu: Oldalpanel megjelenítése/rejtése

source: <b>Auto-completion:</b>
hu: <b>Automatikus kiegészítés:</b>

source: Auto-Completion of Brackets and Quotes
hu: Idézőjelek és zárójelek automatikus lezárása

source: Auto-complete the closing brackets/quotes
hu: Idézőjelek és zárójelek automatikus lezárása

source: Delay (calltip/function list)
hu: Késleltetés (gyorstip/függvény lista)

source: General
hu: Általános

source: <b>Tabs:</b>
hu: <b>Tabulátorok:</b>

source: Tab size:
hu: Tabulátorméret:

source: Use tabs instead of spaces for indentation
hu: Behúzás szóközzel tabulátor helyett

source: Show indentation guides
hu: Segédvonalak megjelenítése vagy elrejtése

source: <b>Line Properties:</b>
hu: <b>Sorbeállítások:</b>

source: Wrap long lines
hu: Hosszú sorok tördelése

source: Highlight Caret Line
hu: Aktuális sor kiemelése

source: <b>PHP Coding:</b>
hu: <b>PHP kódolás:</b>

source: Syntax check program
hu: Szintaxis-ellenőrző program

source: Recognised PHP file extensions
hu: Felismert PHP fájlkiterjesztések

source: Shared library path(s)
hu: Osztott programkönyvtár(ak)

source: Editor
hu: Szerkesztő

source: Font
hu: Betűtípus

source: Editor _font:
hu: Szerkesztő betűtípusa:

source: Color Scheme
hu: Színséma

source: Colour
hu: Szín

source: Plugin
hu: Bővítmény

source: Preferences
hu: Beállítások

source: Unable to create %s (%d) %s
hu: Nem sikerült létrehozni: %s (%d) %s

source: "%s" not found, no replacements made.
hu: A "%s" kifejezés nem található, ezért a csere nem végrehajtható.

source: 1 occurence of "%s" found, replaced.
hu: A keresett "%s" kifejezés 1 helyen kicserélve.

source: "%d" occurences of "%s" found, all replaced.
hu: A keresett "%s" kifejezés "%d" helyen kicserélve.

source: Replace _all
hu: Összes cseréje

source: Replace
hu: Csere

source: Search for:
hu: Keresés:

source: Could not open %s file
hu: Nem sikerült megnyitni a %s fájlt

source: Syntax Check Output
hu: Szintaxis-ellenőrzés

source: You don't have any files open to check
hu: Több fájlt nem lehet megnyitni ellenőrzésre

source: CANNOT Create templates file:: %s
hu: Nem lehet létrehozni ezt a sablonfájlt: %s

source: CANNOT Create templates file: %s
hu: Nem lehet létrehozni ezt a sablonfájlt: %s

source: Templates
hu: Sablonok

source: Name/Shortcut
hu: Név

source: Are you sure you want to delete template %s?
hu: %s sablon biztosan törölhető?

source: Active Templates:
hu: Aktív sablonok:

source: Templates:
hu: Sablonok:

source: New File
hu: Új fájl

source: Open File
hu: Fájl megnyitása

source: Save current File
hu: A jelenlegi fájl mentése

source: Save File As...
hu: Fájl mentése másként

source: Undo last change
hu: Utolsó módosítás visszavonása

source: Redo last change
hu: Utolsó visszavont módosítás ismételt végrehajtása

source: Cut Current Selection
hu: A kijelölés áthelyezése a vágólapra

source: Copy Current Selection
hu: A jelenlegi kijelölés másolása

source: Paste text from clipboard
hu: Szöveg beillesztése a vágólapról

source: Find text
hu: Szöveg keresése és cseréje...

source: Replace Text
hu: Szöveg cseréje

source: Indent Selected Text
hu: Kiválasztott szöveg behúzásának növelése

source: Unindent Selected Text
hu: Kiválasztott szöveg behúzásának csökkentése

source: Increases Zoom level
hu: Nagyítás

source: Decreases Zoom level
hu: Kicsinyítés

source: Zoom 100%
hu: 100% nagyítás
